title: Kali Linux Detection
status: experimental
description: Detects Kali Linux on the Network
author: Kevin Ruthemeyer
logsource:
    zeek-os:
        product: zeek
        service: OS
        conditions:
            event.dataset: 'os'
defaultindex: "*:so-*"
detection:
    selection:
        field: detection.OS
    condition: Kali Linux
falsepositives:
    - None
fields:
    - source.ip
level: high
